def f(x):
    # записываем отрезки из условия
    P = 17 <= x <= 58
    Q = 29 <= x <= 80
    A = a1 <= x <= a2
    # записываем логическую функцию
    return P <= ((Q and (not A)) <= (not P))

# создаем массив для ответа
res = []
# проходимся по всем возможным интересующим нас точкам
d = [y for x in (17, 29, 58, 80) for y in (x, x + 0.1, x - 0.1)]
# берем границы для отрезка A - точки a1 и a2
for a1 in d:
    for a2 in d:
        # если это действительно отрезок и
        # для всех иксов из d функция истинна
        if a2 >= a1 and all(f(x) for x in d):
            # то добавляем длину отрезка A
            res += [a2 - a1]
# просили найти наименьшую длину
print(round(min(res)))