max_line = current_line = 0
# читаем построчно файл
for line in open('9_5.txt'):
    # считаем каждую прочитанную строчку
    current_line += 1
    # записываем числа строки в массив
    a = [int(x) for x in line.split()]
    # если количество чисел равно уникальному набору из этих чисел (set) 
    if len(a) == len(set(a)) \
        and (min(a) + max(a)) * 2 == (sum(a) - min(a) - max(a)) * 3:
        # и 2 * (мин + макс) равна 3 * сумму оставшихся, т.е. сумме всех - (мин + макс)
        max_line = current_line
        # то запомним строку, последняя запомненная строка = последняя подходящая
print(max_line)