a = [1, 2, 3, 3, 4, 5]

# можно организовывать повторы генератором (см. видеоурок),
# но тогда при повторах будут появляться дубликаты
повторы_списком = [x for x in a if a.count(x) == 2]
# повторы_списком = [3, 3]

# возьмем число из массива за x, если оно
# встречается в массиве 2 раза, то запишем его
повторы_сетом = set(x for x in a if a.count(x) == 2)
# повторы = {3}

b = [1, 2, 1, 1, 4, 5, 6, 2, 2, 6]

повторы_по_2 = set(x for x in b if b.count(x) == 2)
повторы_по_3 = set(x for x in b if b.count(x) == 3)
# повторы_по_2 = {6}
# повторы_по_3 = {1, 2}