# счетчик подходящих строк
counter = 0
# читаем каждую строку в файле
for line in open('9_7.txt'):
    # записываем числа строки в массив
    a = [int(x) for x in line.split()]
    # отсортируем массив чисел, чтобы наибольшие числа были в конце
    a.sort()
    # если длина массива равно его уникальному набору (set)
    if len(a) == len(set(a)) and \
        a[3] + a[4] <= a[0] + a[1] + a[2]:
        # и сумма двух наибольших (двух последних, тк массив отсортирован
        # по возрастанию) не больше (меньше или равна) сумме трех первых 
        # (трех наименьших)
        counter += 1
        # то считаем эту строку
print(counter)