line_number = 0
# читаем построчно файл
for line in open('9_6.txt'):
    # считаем каждую прочитанную строку
    line_number += 1
    # записываем числа строки в массив
    a = [int(x) for x in line.split()]
    # смотрим какие числа повторяются по 2 раза
    повторы = set(x for x in a if a.count(x) == 2)
    # и какие не повторяются (встречаются 1 раз)
    не_повторы = [x for x in a if a.count(x) == 1]
    # если 2 повторяющихся, например, [2, 2, 4, 4] и 3 различных
    if len(повторы) == 2 and len(set(не_повторы)) == 3 and \
        sum(повторы) / len(повторы) < max(не_повторы):
            print(line_number)
            # найти наименьшее, значит первое найденное = ответ
            break