from math import dist

# Функция на поиск центра кластера, параметром (cl)
# берем кластер, центр которого хотим найти
def center(cl):
    # Создаем массив для сравнения
    m = []
    # Перебираем все точки кластера, чтобы найти 
    # суммарное расстояние от всех точек до нее
    for p in cl:
        sm = sum([dist(p, p1) for p1 in data])
        # и сохраняем это расстояние и точку
        m.append((sm, p))
    # На выводе попросим найти минимальное расстояние 
    # среди всех, и получим (sm, p) от которого нам 
    # нужна только точка p, [1]-й элемент
    return min(sm)[1]