from math import dist

def aim(cl):
    # Создаем массив для сравнения
    m = []  
    # Перебираем все точки кластера
    for p in cl:  
        # Считаем количество точек в единичной окрестности
        k = len([p1 for p1 in cl if dist(p, p1) <= 1])
        # Сохраняем информацию о точке: кол-во соседей, 
        # координата X (чтобы минимум взял большую точку за 
        # минимум), сама точка
        m.append([k, p[0], p])
    # Возвращаем точку с максимальным количеством соседей, 
    # а если таких точек несколько, выбирается та, 
    # у которой наибольшая координата X
    return max(m)[2]