# прочитаем весь файл в переменную
s = [int(k) for k in open('17_3.txt').readlines()]
# Найдем по этому файлу максимальное число
# модуль которого при делении на 100 дает ост. 25
# Это будет означать, что оно оканчивается на 25
max_25 = max(x for x in s if abs(x) % 100 == 25)

# будем записывать подходящую сумму в res
# затем найдем его длину и максимальный элемент для ответа
res = []
# перебираем тройки
for i in range(len(s) - 3 + 1):
    a = [x for x in s[i:i + 3]]
    # мы берем каждое число в тройке по модулю, смотрим длину
    # его строчного представления, если она = 4, то записываем
    # 1 в список. Если потом сумма этого списка меньше 3,
    # то значит, что всего было меньше 3 таких чисел.
    # И если их < 3 и сумма тройки меньше чем max_25, то
    if len([x for x in a if len(str(abs(x))) == 4]) < 3 \
    and sum(a) <= max_25:
        # запоминаем сумму тройки, тк позже будет
        # удобнее найти максимальную среди всех
        res.append(sum(a))
    
# количество троек - это длина res, тк мы записывали в res
# сумму каждой подходящей тройки, макс сумма - макс элемент res 
print(len(res), max(res))