# считываем файл в одну переменную
s = [int(k) for k in open('17_4.txt').readlines()]
# перебираем все числа из s, если длина строки модуля этого числа равна 4, 
# и при этом остаток при делении на 10 модуля числа равен 3 (то есть число
# оканчивается на 3). Числа записаны в массив, длина которого в квадрате
# это наше условие для сравнения
l = len([x for x in s if len(str(abs(x))) == 4 if abs(x) % 10 == 3]) ** 2

# будем записывать подходящую сумму в res
# затем найдем его длину и максимальный элемент для ответа
res = []
# перебираем тройки
for i in range(len(s) - 3 + 1):
    a = [x for x in s[i:i + 3]]
    # отсортируем массив с тройкой, чтобы два наибольших числа
    # были под индексами 1 и 2
    a.sort()
    # если эта сумма больше, чем квадрат количества чисел ..., то
    if a[1] + a[2] > l:
        # записываем сумму тройки в res
        res.append(sum(a))
# количество подходящих троек = количество элементов в res
# берем наибольшее число под модулем для второго ответа
print(len(res), abs(max(res)))