from ipaddress import *

# будем записывать результат в res
res = []
# переберем маски
for mask in range(33):
    # зададим сеть (всегда пишите 0, он нужен для того,
    # чтобы если сеть неправильная, прога ее починила сама)
    net = ip_network(f'84.23.84.23/{mask}', 0)
    # если адрес сети совпадает с адресом из условия
    if net.network_address == ip_address('84.23.84.0'):
        # заведем переменную для четырех байтов маски
        # например, byte = [255, 255, 255, 224]
        byte = [int(x) for x in str(net.netmask).split('.')]
        # добавим сумму байтов с третьего
        res.append(sum(byte[2:]))
# просили найти максимальную сумму
print(max(res))