# ф-ия для проверки простоты числа
# она работает наоброт от функции по поиску делителей:
# если она находит делитель, то возвращает 0 — число
# составное, а если не находит, то 1 — число простое.
def is_prime(n):
    # перебираем возможные делители числа до корня
    for i in range(2, int(n ** 0.5) + 1):
        # если это делитель, то число составное
        if n % i == 0: return 0
    return 1

# ф-ия для поиска простых делителей числа
def prime_dividers(n):
    # в m будем записывать все простые делители
    m = []
    # перебираем возможные делители числа до корня
    for i in range(2, int(n ** 0.5) + 1):
        # если это делитель числа
        if n % i == 0:
            # и этот делитель — простое число
            if is_prime(i):
                # то записываем его в m
                m.append(i)
            # или если обратный ему делитель это 
            # простое число, то добавляем его
            if is_prime(n // i):
                m.append(n // i)
    return m

# переберем числа в заданном промежутке
for i in range(25317, 51237 + 1):
    # и запишем все простые делители числа в переменную
    d = prime_dividers(i)
    # если их хотя бы 6, то выводим ответ
    if len(d) >= 6:
        print(i, max(d))