# создадим ф-тю для поиска делителей
def dividers(n):
    # перебираем делители от 2 до корня числа,
    # тк делители больше корня можно получить, путем
    # деления числа на его делитель меньше корня
    for i in range(2, int(n ** 0.5) + 1):
        # если число делится на этот делитель
        if n % i == 0:
            # то выписываем сумму его и делителя
            # числа на него же
            return i + n // i
    # если ничего не нашли, то вернем 0
    return 0

# переменная для вывода первых 5 чисел
count = 0
# перебираем исходные числа от 700 000
for k in range(700_000, 10 ** 10):
    # и находим для них число M
    M = dividers(k)
    # если M оканчивается на 4
    if M % 10 == 4:
        # то выводим число и его M
        print(k, M)
        # увеличиваем счетчик для выключения
        # программы после 5го найденного числа
        count += 1
    # если нашлось 5 чисел, прерываем перебор
    if count == 5:
        break