s = open('24_11.txt').readline()

# случайно выбираем число, меньшее длниы искомой подстроки 
m = 0
# будем создавать подстроки из s, перебором левой и правой границ. 
# Будем перебирать левую границу от 0 до конца строки, а правую от
# левой + маскимальной длины строки, что мы успели найти до конца строки.
for l in range(len(s)):
    for r in range(l + m, len(s)):
        # Образованная границами подстрока
        c = s[l:r + 1]

        # Если в ней больше чем 1 X или Y, то как ее не увеличивай, она нам 
        # не подойдет. Поэтому делаем break, и ищем другие границы
        if c.count('X') > 1 or c.count('Y') > 1: break
        # Если же break не произошел и строка подходит, то сохраним 
        # ее длину, если она больше чем уже накопленная m
        m = max(m, len(c))

print(m)