s = open('24_13.txt').readline()

# минимально возможное m, когда 2025 (4 символа) встречается 
# 90 раз и Y встречается 80 раз для оптимального перебора
m = 4 * 90 + 80
# перебираем левую границу с 0 до конца строки
for l in range(len(s)):
    # перебираем правую границу с левой + накопленного m (тк все
    # строки короче не подойдут) до конца строки
    for r in range(l + m, len(s)):
        # составляем подстроку
        c = s[l:r+1]
        # если Y больше 80, то строка не сможет обратно 
        # стать подходящей, ломаем
        if c.count('Y') > 80: break
        # если она подходит по условиям, то
        if c.count('2025') >= 90 and c.count('Y') == 80:
            # смотрим, длиньше ли она уже накопленной m
            m = max(m, len(c))
    # чтобы скучно не было, можно вывести прогресс кода:
    if l % 100_000 == 0: print(l, len(s), m)
# выводим ответ
print(m)