# импортируем модуль регулярных выражений
from re import *

s = open('24_14.txt').readline()

# — num представляет собой выражение, которое охватывает "0" 
#   или группу, в которой первый символ это "7", "8" или "9",
#   за которым следует последовательность символов 
#   "0", "7", "8" или "9" любой длины.
#   Напр., "0", "7", "70998900", но не "07", "000"
num = r'(0|[789][0789]*)'

# Найдем все совпадения:
# для поиска возьмем x.group() в finditer с выражением:
#   сначала у нас должно быть число, а за ним сколько угодно групп вида:
#   символ "-" или "*", за которым следует num

a = [x.group() for x in finditer(rf'{num}([-*]{num})*', s)]

# среди найденных групп, найдем максимальное 
# функцией max и ключом len (то есть поиск по длине)
res = max(a, key=len)
# выведем длину искомой маскимальной подстроки
print(len(res))