s = open('24_12.txt').readline()

# Случайно выбираем большое число, которое должно
# быть меньше искомой строки (если вывод будет равен
# этому числу, то увеличиваем это число)
m = 10_000

# будем перебирать левую границу до конца строки
for l in range(len(s)):
    # а правую границу от самой короткой, что мы нашли до одного символа, 
    # чтобы отфильтровать неподходящие строки 
    for r in range(l + m, l, -1):
        # подстрока
        c = s[l:r+1]

        # если штук RSQ >= 130, то мы все еще можем уменьшить строку, 
        # чтобы она нам подходила
        if c.count('RSQ') >= 130:
            # если Q не последняя буква
            if c[-1] != 'Q': 
                # то сохраним длину подстроки, если она меньше m
                m = min(m, len(c))
        # а если подстрока содержит меньше 130 RSQ, то мы 
        # не сможем добавить к ней символов (в переборе с шагом -1),
        # поэтому она нам не подходит
        else: break

print(m)