from re import *

s = open('24_17.txt').readline()

# Чтобы увеличить читабельность регулярного выражения, запишем ее по частям
# num — подходящее под условие задачи число - ноль ИЛИ ненулевая цифра, 
#       за которой следует 0 - беск. раз любая цифра
num = r'([1-9][0-9]*|0)'

# proiz — запись, состоящая из:
# — Группы num и символа звездочки 0 - беск. раз
# — Нолика
# — Группы num и символа звездочки 0 - беск. раз
proiz = rf'({num}\*)*0(\*{num})*'
# Таким образом, мы записали произведение, которое всегда будет равно нулю, 
# так как умножается на ноль

# Итоговое выражение будет состоять из:
# — Нулевого произведения (proiz)
# — Группы из ( символа "+" и нулевого произведения (proiz) ) 0 - беск. раз
a = [x.group() for x in finditer(rf'{proiz}(\+{proiz})*', s)]

# ищем среди подстрок максимальную по длине
res = max(a, key=len)
print(len(res))