f = open('26_11.txt')

# вводные данные первой строки
n = int(f.readline())

# прочтем файл построчно, и будем запоминать
# номер строки как номер детали
data = []
for i in range(n):
    шлиф, окраш = map(int, f.readline().split())
    data.append((шлиф, окраш, i + 1))

# отсортируем данные по меньшему времени обработки
# (если шлифовка меньше, то значение для сортировки 
# оценивается по ней, и наоборот)
data.sort(key=lambda x: min(x[0], x[1]))

# отправляя детали на шлифовку, будем считать их 
на_шлифовку = 0

# сразу можем вывести ответ на первый вопрос: номер
# последней детали, это номер последней отсортированной
# нами детали ([2] элементом мы записывали номер)
last_деталь = data[-1][2]
print(last_деталь, end=' ')

# перебирая детали из данных
for item in data:
    шлиф, окраш, номер = item
    
    # если номер детали совпадает с номером последней
    # детали, то перед учетом детали выведем кол-во
    # деталей, что мы уже отправили на шлифовку
    if номер == last_деталь: print(на_шлифовку)
    
    # По условию, если время шлифовки меньше покраски,
    # то делать отправляют на шлифовку
    if шлиф < окраш: на_шлифовку += 1
