f = open('26_8.txt')

# вводные данные первой строки
n = int(f.readline())

# считываем весь файл и сразу превращаем строки в числа
data = [list(map(int, line.split())) for line in f]
# отсортируем по времени окончания мероприятия (второе число)
data.sort(key=lambda x: x[1])

# точно берем мероприятие, которое закончится раньше всех.
# После него будем брать такие, которые начинаются позже него:
hall = [data[0]]
# перебираем мероприятия
for item in data:
    # если время начала позже или совпадает со временем 
    # окончания [1] последнего [-1] мероприятия в hall (все 
    # подходящие мероприятия в одном массиве), то сохраняем его 
    if item[0] >= hall[-1][1]: hall.append(item)
# так мы уже можем получить первый ответ: какое максимальное 
# количество мероприятий можно провести в конференц-зале
# (end = ' ' <- чтобы следующий ответ вывелся в этой же строке)
print(len(hall), end=' ')

# Максимально возможный перерыв будет достигаться в случае, 
# если мы возьмем последнее мероприятие с как можно поздним 
# началом. Найдем такое перебором:
max_time = 0
# время конца предпоследнего мероприятия:
dt = hall[-2][1]
# переберем все мероприятия:
for i in data:
    # если его время начала позже или совпадает с предпоследним,
    # то мы его запомним, если оно больше уже найденного 
    if i[0] >= dt: max_time = max(max_time, i[0])
# Так как попросили время ПЕРЕРЫВА, то мы вычтем из 
# самого позднего начала время конца предпоследнего:
print(max_time - dt)