f = open('26_7.txt')

# вводные данные первой строки
n = int(f.readline())

# Прочитаем файл и отсортируем в порядке убывания,
# чтобы взять как можно больше коробок (жадный алгоритм)
data = sorted([int(f.readline()) for x in range(n)], reversed=1)

# Возьмем самую большую коробку, и будем выбрать 
# следующую, как только она станет меньше последней на 9
current_box = data[0]
counter = 1
# перебираем все коробочки
for box in data:
    # если эта коробка меньше последней на 9+
    if box <= current_box - 9:
        # то посчитаем ее, и укажем, что взяли ее
        counter += 1
        current_box = box

# выведем количество и последнюю коробку
print(counter, current_box)