f = open('26_10.txt')

# вводные данные первой строки
n = int(f.readline())
# Прочтем и отсортируем файл по убыванию
data = sorted([int(k) for k in f], reverse=1)

# Запишем найденный максимум камер в:
max_камер = 0

# Максимум камер можно взять, если взять самую
# дальнюю (первую в data), а за ней брать первую
# подходящую (расстояние между ними больше 10)
camera_set = [data[0]]
for cam in data:
    # если расстояние между последней 
    # установленной камерой и выбранной больше 10
    if camera_set[-1] - cam >= 10:
        # то устанавливаем выбранную камеру
        camera_set.append(cam)

# Количество установленных камер это длина camera_set,
# а минимальное расстояние при таком кол-ве камер 
# до первой камеры это координаты последней камеры
print(len(camera_set), camera_set[-1])