f = open('26_12.txt')

# вводные данные первой строки
n = int(f.readline())

# считыаваем файл в set, чтобы избежать повторов, и сортируем его
data = sorted({tuple(map(int, line.split())) for line in f})

# теперь n это длина получившегося set
n = len(data)

# Будем увеличивать счетчик для человека за каждую задачу через 1,
# и сохранять максимум задач при его сбросе
counter = максимум_задач = 1

# условие для вывода ответа =0 == еще не вывели, =1 == уже вывели
вывели_ответ = 0

# перебираем учениклов
for i in range(1, n):
    # если id ученика совпадает с предыдущим и номер предыдущей 
    # задачи через одну совпадает с текущей
    if data[i][0] == data[i - 1][0] and data[i - 1][1] + 2 == data[i][1]:
        # то увеличиваем счетчик
        counter += 1
    # а если условие перестало выполняться (или не выполнилось)
    else:
        # то сохраним число, если это максимум
        максимум_задач = max(максимум_задач, counter)
        # выведем его, если еще не вывели
        # (можно запустить программу без этого блока, 
        # тогда она выведет, что максимум задач был 42)
        if counter == 42 and not вывели_ответ: 
            вывели_ответ = 1
            print(data[i][0], end=' ')
        # и сбросим счетчик
        counter = 1
# в конце выводим максимум задач у человека
print(максимум_задач)