f = open('26_5.txt')

# вводные данные первых двух строк
сотрудников = int(f.readline())
номеров = int(f.readline())

# Будем читать файл и записывать время заезда
# и время выезда (= время заезда + время пребывания)
data = []
for line in f:
    въезд, срок = [int(x) for x in line.split()]
    data.append([въезд, въезд+срок])
# Отсортируем по возрастанию
data.sort()

# Заведем переменные для кол-ва заселившихся 
# и последней занятой комнаты
counter = last_room = 0

# Создадим отель с комнатами заполненными нулевым 
# временем выезда. Так как дни в задаче с 1, то 
# любой сотрудник сможет поселитиься в такую комнату
hotel = [0 for _ in range(номеров)]

# Переберем сотрудников
for person in data:
    # и для каждого переберем комнату
    for room in range(номеров):
        # если его время прибытия позже 
        # дня выселения из этой комнаты
        if person[0] > hotel[room]:
            # то заселяем его (достаточно сохранить 
            # время выселения для предыдущего шага)
            hotel[room] = person[1]
            # увеличиваем счетчик и запоминаем комнату
            counter += 1
            last_room = room + 1 # нумерация комнат с 1
            break
# Выведем кол-во заселившихся и номер комнаты, 
# в которую заселелись последней
print(counter, last_room)