f = open('26_1.txt')

# Запишем первую строку - сколько всего пассажиров было на рейсе
total_passengers = int(f.readline()) 

# Составим два массива. В первый будем записывать время захода 
# пассажира, во второй - время выхода
entered = []
left = []

# Прочтем всех пассажиров и запишем время входа и выхода в соответсвующий массив
for _ in range(total_passengers):
    enter_time, leave_time = map(int, f.readline().split())
    entered.append(enter_time)
    left.append(leave_time)

# Создадим переменные для максимума пассажиров и времени 
# нахождения максимального кол-во пассажиров в автобусе
max_passengers = total_more_than_one_time = 0

# сейчас внутри 0 человек. По ходу чтрения временной линии 
# это число будет увеличиваться/уменьшаться
inside = 0

# Временная линия - отрезок времени в единицах, обычно это 24 часа, 1440 минут
# Здесь временная линия составляет 1_000_000 условных единиц
for i in range(1_000_000 + 1):
    # на каждой отметке будем проверять, 
    # сколько людей зашло и сколько вышло
    inside += entered.count(i) - left.count(i)
    # и записывать абсолютный максимум пассажиров
    max_passengers = max(max_passengers, inside)

    # пока внутри есть пассажиры, добавляем 1 ко времени, 
    # когда был хотя бы 1 пассажир
    if inside > 0:
        total_more_than_one_time += 1

# выводим ответ строго в правильном порядке
print(max_passengers, total_more_than_one_time)