f = open('26_2.txt')

# Вводные данные первой строки
n = int(f.readline())

# Составим два массива. В первый будем записывать время захода 
# пассажира, во второй - время выхода
entered = []
left = []

# Прочтем всех сотрудников и запишем время входа и выхода
# в соответсвующий массив
for _ in range(n):
    enter_time, leave_time = map(int, f.readline().split())
    entered.append(enter_time)
    left.append(leave_time)

# Временная линия - отрезок времени в единицах, обычно это 24 часа, 1440 минут
# Создадим временную линию длиной в 1 день (включая 1440, чтобы счет был с 1)
inside = [0 for _ in range(1441)]

# Переменные для записи ответа:
# Максимум людей внутри
max_inside = 0
# массив для нахождения предпоследнего человека
изменения = []
# и счетчик кол-ва минут без изменений
cur = 1

# Для каждой минуты посмотрим, сколько людей зашло и сколько вышло
for minute in range(1, 1441): # (range без последнего)
    inside[minute] = inside[minute - 1] + entered.count(minute) - left.count(minute)

    # Если кол-во человек совпадает с предыдущим ходом,
    # то увеличиваем кол-во минут без изменений на 1
    if inside[minute] == inside[minute - 1]: cur += 1
    # А если разное, 
    else:
        # то сохраним эту минуту,
        изменения.append(minute)
        # сохраним текущее кол-во минут без изменений, если оно больше накопленного
        max_inside = max(max_inside, cur)
        # и сбросим счетчик
        cur = 1

# выводим ответ строго в правильном порядке
print(изменения[-2], max_inside)