from itertools import *

counter = otvet = 0
# отсортируем буквы по алфавитному порядку и напишем repeat=5 штук
for p in product(sorted('СТРОКА'), repeat=5):
    counter += 1 # для каждого слова считаем его номер

    # если первая буква (нулевой индекс) не 'А' и не 'Л' и 'С' только 1
    if p[0] != 'А' and p[0] != 'Л' and p.count('С') == 1:
        # если номер этой перестановки нечетный, то запомним его
        if counter % 2 == 1: otvet = counter

# последний запомненный номер это последний номер подходящей перестановки
print(otvet)