# создадим рекурсивную ф-ию с параметром flag
def f(x, end, flag=0):
    if x > end: return 0
    if x == end: return 1
    # если x 20 или 30
    if x == 20 or x == 30:
        # и флаг поднят, то значит оба числа встретились
        # в одной траектории, значит она не подходит
        if flag: return 0
        # здесь флаг не поднят, но встретилось одно из чисел,
        # поэтому поднимем его для следующего 
        flag = 1
    # вызываем команды исполнителя с запоминанием состояния флага
    return f(x + 2, end, flag) + f(x + 3, end, flag) + f(x * 2, end, flag)

print(f(8, 35))