# создаем рекурсивную функцию
def f(x, end):
    # тк числа уменьшаются (нужно из 19 прийти в 2), то условие
    # на неподходящее число, это условие, что оно меньше конечного
    if x < end: return 0
    # если оно равно конечному, то путь подходит
    if x == end: return 1
    # если оно равно восьми, то путь не подходит (по условию)
    if x == 8: return 0
    # рекурсивные пути: вычесть 1, 4 или найти целую часть при дел на 3
    return f(x - 1, end) + f(x - 4, end) + f(x // 3, end)

print(f(19, 14) * f(14, 2))