# создадим рекурсивную функцию, которая будет 
# проверять, является ли число после хода подохдящим
def f(x, end):
    # если полученное число (для первого хода — вводное число) 
    # больше конечного, то этот путь не подходит
    if x > end: return 0
    # если оно равно конечному, то этот путь подходит
    if x == end: return 1
    # если оно не больше конечного и не конечное, то
    # запустим рекурсию в возможные пути для этого числа:
    # приавить 4 и умножение на 2
    return f(x + 4, end) + f(x * 2, end)
    
# найдем количество путей
print(f(13, 42))