# перевод операнда в число
def convert(a, n):
    # переворачиваем массив для удобства
    a = a[::-1]
    # сумма цифр
    s = 0
    # перевод числа как вручную, где i
    # индекс цифры и степень для возведения
    for i in range(len(a)):
        # складываем полученное число с набранными
        s += a[i] * n ** i
    return s

# перебираем x для кратности 28
for x in range(29):
    # записываем два числа
    a = convert([4, 6, 3, x, 7, 9, 2, 1], 29)
    b = convert([8, 2, 4, 1, x, 1, 5, 3], 29)
    # если сумма кратна 28
    if (a + b) % 28 == 0:
        # то пишем то, что требуют
        print((a + b) // 28)
        break