# ф-я конвертер
def convert(n):
    # заведем переменную для хранения цифр
    # числа в 9-ричной сс
    n9 = ''
    while n > 0:
        # будем добавлять ост. при дел. на 9 
        # вперед числа
        n9 = str(n % 9) + n9
        # и делить его на 9 (как в ручном переводе)
        n //= 9
    # вернем строковое представление числа в 9-й сс
    return n9

# переберем все x
for x in range(3000):
    # тогда число выглядит так:
    s = 9 ** 150 + 9 ** 30 - x
    # число в 9-й сс
    s9 = convert(s)
    # если нулей в нём 122
    if s9.count('0') == 122:
        # то самое первое вхождение 
        # мы выписываем и останавливаемся
        print(x)
        break